{
    "poems": [
        {
            "id": "0",
            "disable": "1",
            "title": "信竞",
            "author": "佚名",
            "context": "信竞人，信竞魂，信竞人是人下人。 彻夜台前空寂寞，测试暴零独饮恨。 一月习得函数前，十月已过无新垦。 动规搜索与二分，唯有初赛纸上认。 复赛上机徒一乐，比赛半日泪已奔。 遇题幸运知三四，打表剪枝侥骗分。 昨日身在五联中，今日摇身聚金盆。 周二例题与讨论，周六机考亦健身。 今日即将入考场，破釜沉舟补数论。 纵使自知不可为，取一放三搜索镇。 早安！信竞人！"
        },

        {
            "id": "7112",
            "title": "闻王昌龄左迁龙标遥有此寄",
            "author": "李白",
            "context": "杨花落尽子规啼，闻道龙标过五溪。 我寄愁心与明月，随君直到夜郎西。"
        },
        {
            "id": "912",
            "title": "岳阳楼记",
            "author": "范仲淹",
            "context": "庆历四年春，滕子京谪守巴陵郡。 越明年，政通人和，百废具兴。 乃重修岳阳楼，增其旧制，刻唐贤今人诗赋于其上。 属予作文以记之。 予观夫巴陵胜状，在洞庭一湖。 衔远山，吞长江，浩浩汤汤，横无际涯； 朝晖夕阴，气象万千。 此则岳阳楼之大观也，前人之述备矣。 然则北通巫峡，南极潇湘，迁客骚人，多会于此，览物之情，得无异乎?  若夫淫雨霏霏，连月不开，阴风怒号，浊浪排空； 日星隐耀，山岳潜形； 商旅不行，樯倾楫摧； 薄暮冥冥，虎啸猿啼。 登斯楼也，则有去国怀乡，忧谗畏讥，满目萧然，感极而悲者矣。 至若春和景明，波澜不惊，上下天光，一碧万顷； 沙鸥翔集，锦鳞游泳； 岸芷汀兰，郁郁青青。 而或长烟一空，皓月千里，浮光跃金，静影沉璧，渔歌互答，此乐何极！ 登斯楼也，则有心旷神怡，宠辱偕忘，把酒临风，其喜洋洋者矣。 嗟夫！予尝求古仁人之心，或异二者之为，何哉？ 不以物喜，不以己悲； 居庙堂之高则忧其民，处江湖之远则忧其君。 是进亦忧，退亦忧。 然则何时而乐耶？其必曰：“先天下之忧而忧，后天下之乐而乐”乎。 噫！微斯人，吾谁与归？时六年九月十五日。"
        },
        {
            "id": "913",
            "title": "醉翁亭记",
            "author": "欧阳修",
            "context": "环滁皆山也。 其西南诸峰，林壑尤美，望之蔚然而深秀者，琅琊也。 山行六七里，渐闻水声潺潺而泻出于两峰之间者，酿泉也。 峰回路转，有亭翼然临于泉上者，醉翁亭也。 作亭者谁？山之僧智仙也。 名之者谁？太守自谓也。 太守与客来饮于此，饮少辄醉，而年又最高，故自号曰醉翁也。 醉翁之意不在酒，在乎山水之间也。 山水之乐，得之心而寓之酒也。 若夫日出而林霏开，云归而岩穴暝，晦明变化者，山间之朝暮也。 野芳发而幽香，佳木秀而繁阴，风霜高洁，水落而石出者，山间之四时也。 朝而往，暮而归，四时之景不同，而乐亦无穷也。 至于负者歌于途，行者休于树，前者呼，后者应，伛偻提携，往来而不绝者，滁人游也。 临溪而渔，溪深而鱼肥。酿泉为酒，泉香而酒洌； 山肴野蔌，杂然而前陈者，太守宴也。 宴酣之乐，非丝非竹，射者中，弈者胜，觥筹交错，起坐而喧哗者，众宾欢也。 苍颜白发，颓然乎其间者，太守醉也。 已而夕阳在山，人影散乱，太守归而宾客从也。 树林阴翳，鸣声上下，游人去而禽鸟乐也。 然而禽鸟知山林之乐，而不知人之乐； 人知从太守游而乐，而不知太守之乐其乐也。 醉能同其乐，醒能述以文者，太守也。 太守谓谁？庐陵欧阳修也。"
        },
        {
            "id": "914",
            "title": "湖心亭看雪",
            "author": "张岱",
            "context": "崇祯五年十二月，余住西湖。 大雪三日，湖中人鸟声俱绝。 是日更定矣，余一小舟，拥毳衣炉火，独往湖心亭看雪。 雾凇沆砀，天与云与山与水，上下一白。 湖上影子，惟长堤一痕、湖心亭一点、与余舟一芥、舟中人两三粒而已。 到亭上，有两人铺毡对坐，一童子烧酒炉正沸。 见余大喜曰：“湖中焉得更有此人？” 拉余同饮。余强饮三大白而别。问其姓氏，是金陵人，客此。 及下船，舟子喃喃曰：“莫说相公痴，更有痴似相公者！”"
        },
        {
            "id": "9151",
            "title": "行路难(其一)",
            "author": "李白",
            "context": "金樽清酒斗十千，玉盘珍羞直万钱。 停杯投箸不能食，拔剑四顾心茫然。 欲渡黄河冰塞川，将登太行雪满山。 闲来垂钓碧溪上，忽复乘舟梦日边。 行路难！行路难！多歧路，今安在？ 长风破浪会有时，直挂云帆济沧海。"
        },
        {
            "id": "9152",
            "title": "酬乐天扬州初逢席上见赠",
            "author": "刘禹锡",
            "context": "巴山楚水凄凉地，二十三年弃置身。 怀旧空吟闻笛赋，到乡翻似烂柯人。 沉舟侧畔千帆过，病树前头万木春。 今日听君歌一曲，暂凭杯酒长精神。"
        },
        {
            "id": "9153",
            "title": "水调歌头",
            "author": "苏轼",
            "context": "丙辰中秋，欢饮达旦，大醉，作此篇，兼怀子由。 明月几时有？把酒问青天。 不知天上宫阙，今夕是何年？ 我欲乘风归去，又恐琼楼玉宇，高处不胜寒。 起舞弄清影，何似在人间？ 转朱阁，低绮户，照无眠。 不应有恨，何事长向别时圆？ 人有悲欢离合，月有阴晴圆缺，此事古难全。 但愿人长久，千里共婵娟。"
        },
        {
            "id": "9161",
            "title": "月夜忆舍弟",
            "author": "杜甫",
            "context": "戍鼓断人行，边秋一雁声。 露从今夜白，月是故乡明。 有弟皆分散，无家问死生。 寄书长不达，况乃未休兵。"
        },
        {
            "id": "9162",
            "title": "长沙过贾谊宅",
            "author": "刘长卿",
            "context": "三年谪宦此栖迟，万古惟留楚客悲。 秋草独寻人去后，寒林空见日斜时。 汉文有道恩犹薄，湘水无情吊岂知。 寂寂江山摇落处，怜君何事到天涯。"
        },
        {
            "id": "9163",
            "title": "左迁至蓝关示侄孙湘",
            "author": "韩愈",
            "context": "一封朝奏九重天，夕贬潮州路八千。 欲为圣明除弊事，肯将衰朽惜残年！ 云横秦岭家何在？雪拥蓝关马不前。 知汝远来应有意，好收吾骨瘴江边。"
        },
        {
            "id": "9164",
            "title": "商山早行",
            "author": "温庭筠",
            "context": "晨起动征铎，客行悲故乡。 鸡声茅店月，人迹板桥霜。 槲叶落山路，枳花明驿墙。 因思杜陵梦，凫雁满回塘。"
        },
        {
            "id": "9171",
            "title": "咸阳城东楼",
            "author": "许浑",
            "context": "一上高城万里愁，蒹葭杨柳似汀洲。 溪云初起日沉阁，山雨欲来风满楼。 鸟下绿芜秦苑夕，蝉鸣黄叶汉宫秋。 行人莫问当年事，故国东来渭水流。"
        },
        {
            "id": "9172",
            "title": "无题",
            "author": "李商隐",
            "context": "相见时难别亦难，东风无力百花残。 春蚕到死丝方尽，蜡炬成灰泪始干。 晓镜但愁云鬓改，夜吟应觉月光寒。 蓬山此去无多路，青鸟殷勤为探看。"
        },
        {
            "id": "9173",
            "title": "行香子",
            "author": "秦观",
            "context": "树绕村庄，水满陂塘。 倚东风，豪兴徜徉。 小园几许，收尽春光。 有桃花红，李花白，菜花黄。 远远围墙，隐隐茅堂。 r青旗，流水桥旁。 偶然乘兴，步过东冈。 正莺儿啼，燕儿舞，蝶儿忙。"
        },
        {
            "id": "9174",
            "title": "丑奴儿・书博山道中壁",
            "author": "辛弃疾",
            "context": "少年不识愁滋味，爱上层楼。 爱上层楼，为赋新词强说愁。 而今识尽愁滋味，欲说还休。 欲说还休，却道“天凉好个秋”！"
        },
        {
            "id": "922",
            "title": "鱼我所欲也",
            "author": "<<孟子>>",
            "context": "鱼，我所欲也；熊掌，亦我所欲也。 二者不可得兼，舍鱼而取熊掌者也。 生，亦我所欲也；义，亦我所欲也。 二者不可得兼，舍生而取义者也。 生亦我所欲，所欲有甚于生者，故不为苟得也。 死亦我所恶，所恶有甚于死者，故患有所不辟也。 如使人之所欲莫甚于生，则凡可以得生者何不用也？ 使人之所恶莫甚于死者，则凡可以辟患者何不为也？ 由是则生而有不用也，由是则可以辟患而有不为也。 是故所欲有甚于生者，所恶有甚于死者。 非独贤者有是心也，人皆有之，贤者能勿丧耳。 一箪食，一豆羹，得之则生，弗得则死。 呼尔而与之，行道之人弗受； 蹴尔而与之，乞人不屑也。 万钟则不辩礼义而受之，万钟于我何加焉！ 为宫室之美，妻妾之奉，所识穷乏者得我与？ 乡为身死而不受，今为宫室之美为之； 乡为身死而不受，今为妻妾之奉为之； 乡为身死而不受，今为所识穷乏者得我而为之。 是亦不可以已乎？此之谓失其本心。"
        },
        {
            "id": "9251",
            "title": "渔家傲・秋思",
            "author": "范仲淹",
            "context": "塞下秋来风景异，衡阳雁去无留意。 四面边声连角起，千嶂里，长烟落日孤城闭。 浊酒一杯家万里，燕然未勒归无计。 羌管悠悠霜满地，人不寐，将军白发征夫泪。"
        },
        {
            "id": "9252",
            "title": "江城子・密州出猎",
            "author": "苏轼",
            "context": "老夫聊发少年狂，左牵黄，右擎苍，锦帽貂裘，千骑卷平冈。 为报倾城随太守，亲射虎，看孙郎。 酒酣胸胆尚开张，鬓微霜，又何妨！ 持节云中，何日遣冯唐？ 会挽雕弓如满月，西北望，射天狼。"
        },
        {
            "id": "9253",
            "title": "破阵子・为陈同甫赋壮词以寄之",
            "author": "辛弃疾",
            "context": "醉里挑灯看剑，梦回吹角连营。 八百里分麾下炙，五十弦翻塞外声。沙场秋点兵。 马作的卢飞快，弓如霹雳弦惊。 了却君王天下事，赢得生前身后名。可怜白发生！"
        },
        {
            "id": "9254",
            "title": "满江红",
            "author": "秋瑾",
            "context": "小住京华，早又是中秋佳节。 为篱下黄花开遍，秋容如拭。 四面歌残终破楚，八年风味徒思浙。 苦将侬强派作蛾眉，殊未屑！ 身不得，男儿列，心却比，男儿烈。 算平生肝胆，因人常热。 俗子胸襟谁识我？英雄末路当磨折。 莽红尘何处觅知音？青衫湿！"
        },
        {
            "id": "9261",
            "title": "定风波",
            "author": "苏轼",
            "context": "三月七日，沙湖道中遇雨。 雨具先去，同行皆狼狈，余独不觉，已而遂晴，故作此词。 莫听穿林打叶声，何妨吟啸且徐行。 竹杖芒鞋轻胜马，谁怕？一蓑烟雨任平生。 料峭春风吹酒醒，微冷，山头斜照却相迎。 回首向来萧瑟处，归去，也无风雨也无晴。 "
        },
        {
            "id": "9262",
            "title": "临江仙・夜登小阁忆洛中旧游",
            "author": "陈与义",
            "context": "忆昔午桥桥上饮，坐中多是豪英。长沟流月去无声。 杏花疏影里，吹笛到天明。 二十余年如一梦，此身虽在堪惊。闲登小阁看新晴。 古今多少事，渔唱起三更。"
        },
        {
            "id": "9263",
            "title": "太常引・建康中秋夜为吕叔潜赋",
            "author": "辛弃疾",
            "context": "一轮秋影转金波，飞镜又重磨。 把酒问娥：被白发、欺人奈何？ 乘风好去，长空万里，直下看山河。 斫去桂婆娑，人道是、清光更多。"
        },
        {
            "id": "9264",
            "title": "浣溪沙",
            "author": "纳兰性德",
            "context": "身向云山那畔行，北风吹断马嘶声，深秋远塞若为情！ 一抹晚烟荒戍垒，半竿斜日旧关城。古今幽恨几时平！"
        },
        {
            "id": "92B1",
            "title": "十五从军征",
            "author": "<<乐府诗集>>",
            "context": "十五从军征，八十始得归。 道逢乡里人：“家中有阿谁？” “遥看是君家，松柏冢累累。” 兔从狗窦入，雉从梁上飞。 中庭生旅谷，井上生旅葵。 舂谷持作饭，采葵持作羹。 羹饭一时熟，不知饴阿谁。 出门东向看，泪落沾我衣。"
        },
        {
            "id": "92B2",
            "title": "白雪歌送武判官归京",
            "author": "岑参",
            "context": "北风卷地白草折，胡天八月即飞雪。 忽如一夜春风来，千树万树梨花开。 散入珠帘湿罗幕，狐裘不暖锦衾薄。 将军角弓不得控，都护铁衣冷难着。 瀚海阑干百丈冰，愁云惨淡万里凝。 中军置酒饮归客，胡琴琵琶与羌笛。 纷纷暮雪下辕门，风掣红旗冻不翻。 轮台东门送君去，去时雪满天山路。"
        },
        {
            "id": "92B3",
            "title": "南乡子・登京口北固亭怀古",
            "author": "辛弃疾",
            "context": "何处望神州？满眼风光北固楼。 千古兴亡多少事？悠悠。不尽长江滚滚流。 年少万兜鍪，坐断东南战未休。 天下英雄谁敌手？曹刘。生子当如孙仲谋。"
        },
        {
            "id": "92B4",
            "title": "过零丁洋",
            "author": "文天祥",
            "context": "辛苦遭逢起一经，干戈寥落四周星。 山河破碎风飘絮，身世浮沉雨打萍。 惶恐滩头说惶恐，零丁洋里叹零丁。 人生自古谁无死？留取丹心照汗青。"
        },
        {
            "id": "92B5",
            "title": "山坡羊・潼关怀古",
            "author": "张养浩",
            "context": "峰峦如聚，波涛如怒，山河表里潼关路。 望西都，意踌躇。 伤心秦汉经行处，宫阙万间都做了土。 兴，百姓苦；亡，百姓苦。"
        },
        {
            "id": "92C1",
            "title": "南安军",
            "author": "文天祥",
            "context": "梅花南北路，风雨湿征衣。 出岭同谁出？归乡如不归！ 山河千古在，城郭一时非。 饿死真吾事，梦中行采薇。"
        },
        {
            "id": "92C2",
            "title": "别云间",
            "author": "夏完淳",
            "context": "三年羁旅客，今日又南冠。 无限山河泪，谁言天地宽！ 已知泉路近，欲别故乡难。 毅魄归来日，灵旗空际看。"
        },
        {
            "id": "92C3",
            "title": "山坡羊・骊山怀古",
            "author": "张养浩",
            "context": "骊山四顾，阿房一炬，当时奢侈今何处？ 只见草萧疏，水萦纡。 至今遗恨迷烟树。列国周齐秦汉楚。 赢，都变做了土；输，都变做了土。"
        },
        {
            "id": "92C4",
            "title": "朝天子・咏喇叭",
            "author": "王磐",
            "context": "喇叭，唢呐，曲儿小腔儿大。 官船来往乱如麻，全仗你抬声价。 军听了军愁，民听了民怕。哪里去辨甚么真共假？ 眼见的吹翻了这家，吹伤了那家，只吹的水尽鹅飞罢！"
        },
        {
            "id": "1",
            "disable": "1",
            "title": "",
            "author": "",
            "context": ""
        }
    ]
}